__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           110         input_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           110         dense_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 10)           0           dense_1[0][0]                    
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 10)           0           add_1[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           110         activation_2[0][0]               
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           110         dense_3[0][0]                    
__________________________________________________________________________________________________
add_2 (Add)                     (None, 10)           0           dense_3[0][0]                    
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 10)           0           add_2[0][0]                      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           110         activation_3[0][0]               
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 10)           110         dense_5[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 10)           0           dense_5[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 10)           0           add_3[0][0]                      
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           110         activation_4[0][0]               
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 10)           110         dense_7[0][0]                    
__________________________________________________________________________________________________
add_4 (Add)                     (None, 10)           0           dense_7[0][0]                    
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 10)           0           add_4[0][0]                      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            11          activation_5[0][0]               
==================================================================================================
Total params: 891
Trainable params: 891
Non-trainable params: 0
__________________________________________________________________________________________________
