__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 10)           110         input_3[0][0]                    
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 10)           110         dense_23[0][0]                   
__________________________________________________________________________________________________
add_11 (Add)                    (None, 10)           0           dense_23[0][0]                   
                                                                 dense_24[0][0]                   
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 10)           110         add_11[0][0]                     
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 10)           110         dense_25[0][0]                   
__________________________________________________________________________________________________
add_12 (Add)                    (None, 10)           0           dense_25[0][0]                   
                                                                 dense_26[0][0]                   
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 10)           110         add_12[0][0]                     
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 10)           110         dense_27[0][0]                   
__________________________________________________________________________________________________
add_13 (Add)                    (None, 10)           0           dense_27[0][0]                   
                                                                 dense_28[0][0]                   
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 10)           110         add_13[0][0]                     
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 10)           110         dense_29[0][0]                   
__________________________________________________________________________________________________
add_14 (Add)                    (None, 10)           0           dense_29[0][0]                   
                                                                 dense_30[0][0]                   
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 10)           110         add_14[0][0]                     
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 10)           110         dense_31[0][0]                   
__________________________________________________________________________________________________
add_15 (Add)                    (None, 10)           0           dense_31[0][0]                   
                                                                 dense_32[0][0]                   
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 1)            11          add_15[0][0]                     
==================================================================================================
Total params: 1,111
Trainable params: 1,111
Non-trainable params: 0
__________________________________________________________________________________________________
